app/views/articles/index.html.erb

        </strong>
        (<%= article.comments.count %>)
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]