app/views/articles/show.html.erb

<p>Tags:
   <% @article.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."article_id" = $1  [["article_id", 10]]


<h3>Comments (<%= @article.comments.count %>)</h3>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 10]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 10]]