app/controllers/articles_controller.rb

  def index
    @articles = Article.all
    @comments = Comment.all
    @tags = Tag.all
---
SELECT "articles".* FROM "articles"
SELECT "tags".* FROM "tags"

  def create
    @article = Article.new(article_params)
    @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def destroy
    @article = Article.find(params[:id])
    if @article.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 9]]