app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.article_id = params[:article_id]
    @comment.save
---
INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_name", "Oksana"], ["body", "Hellooooooooooooo there!"], ["article_id", 1], ["created_at", "2021-12-01 21:53:43.792191"], ["updated_at", "2021-12-01 21:53:43.792191"]]