app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "tags" WHERE "tags"."id" = $1  [["id", 5]]
---
  def destroy
    @tag = Tag.find(params[:id])
    if @tag.destroy